app/controllers/alunos_controller.rb

  def index
    @alunos = Aluno.all
---
SELECT "alunos".* FROM "alunos"

  def create
    @aluno = Aluno.new(aluno_params)

    respond_to do |format|
      if @aluno.save
---
INSERT INTO "alunos" ("ativo", "created_at", "depoimento", "email", "nome", "telefone", "turma", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    @aluno.destroy!
---
DELETE FROM "alunos" WHERE "alunos"."id" = ?  [["id", 980190962]]

    def set_aluno
      @aluno = Aluno.find(params.expect(:id))
---
SELECT "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]