app/controllers/conteudos_controller.rb

  def create
    @conteudo = Conteudo.new(conteudo_params)

    if @conteudo.save
---
INSERT INTO "conteudos" ("ativo", "botao_link", "botao_texto", "created_at", "posicao", "secao", "subtitulo", "texto", "titulo", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @conteudo.update(conteudo_params)
---
UPDATE "conteudos" SET "titulo" = ?, "updated_at" = ? WHERE "conteudos"."id" = ?  [["titulo", "Título editado"], ["updated_at", "2026-08-14 01:25:51.768564"], ["id", 980190962]]

  def destroy
    @conteudo.destroy!
---
DELETE FROM "conteudos" WHERE "conteudos"."id" = ?  [["id", 980190962]]

    def set_conteudo
      @conteudo = Conteudo.find(params.expect(:id))
---
SELECT "conteudos".* FROM "conteudos" WHERE "conteudos"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]