app/controllers/professors_controller.rb

SELECT "professors".* FROM "professors"
---
  def index
    @professors = Professor.all

INSERT INTO "professors" ("ativo", "bio", "created_at", "materia", "nome", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["ativo", 0], ["bio", "MyText"], ["created_at", "2026-08-14 01:18:56.992282"], ["materia", "MyString"], ["nome", "MyString"], ["updated_at", "2026-08-14 01:18:56.992282"]]
---
  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save

DELETE FROM "professors" WHERE "professors"."id" = ?  [["id", 980190962]]
---
  def destroy
    @professor.destroy!

SELECT "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_professor
      @professor = Professor.find(params.expect(:id))