app/controllers/projetos_controller.rb

SELECT "projetos".* FROM "projetos"
---
  def index
    @projetos = Projeto.all

INSERT INTO "projetos" ("ativo", "created_at", "descricao", "titulo", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["ativo", 0], ["created_at", "2026-08-14 01:18:57.640931"], ["descricao", "MyText"], ["titulo", "MyString"], ["updated_at", "2026-08-14 01:18:57.640931"]]
---
  def create
    @projeto = Projeto.new(projeto_params)

    respond_to do |format|
      if @projeto.save

DELETE FROM "projetos" WHERE "projetos"."id" = ?  [["id", 980190962]]
---
  def destroy
    @projeto.destroy!

SELECT "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_projeto
      @projeto = Projeto.find(params.expect(:id))